aadabathon/PSoC6AI-workingDir/source/main.c
static TaskHandle_t main_task_handler;
static TimerHandle_t timer_handler;
radar_data_manager_s mgr;

ce_state_s ce_app_state;

volatile bool print_job_locked;

#ifdef ENABLE_RADAR
/*******************************************************************************
* Function Name: read_radar_data
********************************************************************************
* Summary:
* This is the function for reading radar data using buffering
*
* Parameters:
*  * data: pointer to radar data
*  *num_samples: pointer to number of samples per frame
*  samples_ub: maximum number of samples to be copied at a time from owner task/caller
*
* Return:
*  int32_t: 0 if success
*
*******************************************************************************/
int32_t read_radar_data(uint16_t* data, uint32_t *num_samples, uint32_t samples_ub)
{
    if (xensiv_bgt60trxx_get_fifo_data(&bgt60_obj.dev,
            data,
            NUM_SAMPLES_PER_FRAME) == XENSIV_BGT60TRXX_STATUS_OK)
    {
        *num_samples = NUM_SAMPLES_PER_FRAME *2; // in bytes

        if (samples_ub < NUM_SAMPLES_PER_FRAME *2)
        {
            xensiv_bgt60trxx_soft_reset(&bgt60_obj.dev,XENSIV_BGT60TRXX_RESET_FIFO );
        }
    }

    return 0;
}

/*******************************************************************************
* Function Name: reconf_radar
********************************************************************************
* Summary:
* This is the function for radar reconfiguration
*
* Parameters:
*  requested: Choosed configuration
*
* Return:
*  void
*
*******************************************************************************/
void reconf_radar(optimization_type_e requested)
{
    if (requested == CONFIG_UNINITIALIZED)
    {
        return;
    }

    if (xensiv_bgt60trxx_config(&bgt60_obj.dev,
            optimizations_list[requested].reg_list,
            optimizations_list[requested].reg_list_size) != CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: xensiv_bgt60trxx reconfiguration failed\n");
        CY_ASSERT(0);
    }

    if (xensiv_bgt60trxx_set_fifo_limit(&bgt60_obj.dev,
            optimizations_list[requested].fifo_limit) != CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: xensiv_bgt60trxx set fifo limit failed\n");
        CY_ASSERT(0);
    }

    if (xensiv_bgt60trxx_start_frame(&bgt60_obj.dev, true) != CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: xensiv_bgt60trxx_start_frame failed\n");
        CY_ASSERT(0);
    }
}
#endif /* ENABLE_RADAR */


/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
* This is the main function for CM4 CPU. It initializes BSP, creates FreeRTOS
* main task and starts the scheduler.
*
* Parameters:
*  void
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;

    /* Initialize the device and board peripherals */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize retarget-io to use the debug UART port */
    cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);

#ifdef TARGET_APP_CYSBSYSKIT_DEV_01

    /* Initialize the User LED */
    cyhal_gpio_init(CYBSP_USER_LED, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, CYBSP_LED_STATE_OFF);

#endif

#ifdef ENABLE_RADAR
    mgr.in_read_radar_data = read_radar_data;
    radar_data_manager_init(&mgr, NUM_SAMPLES_PER_FRAME *6, NUM_SAMPLES_PER_FRAME *2);
    radar_data_manager_set_malloc_free(pvPortMalloc,
            vPortFree);

    /* \x1b[2J\x1b[;H - ANSI ESC sequence for clear screen */
    printf("\x1b[2J\x1b[;H");
    printf("****************** "
           "Radar presence"
           "****************** \r\n\n"
           "Human presence detection using XENSIV 60-GHz radar\r\n"
           );
    printf("Press ENTER to enter setup mode, press ESC to quit setup mode \r\n");
#else
    printf("\x1b[2J\x1b[;H");
    printf("****************** DeepCraft data logger ****************** \r\n\n"
           "IMU + baro + mag + mic -> merged CSV over serial\r\n");
#endif

    /* Create the RTOS task */
    if (xTaskCreate(main_task, MAIN_TASK_NAME, MAIN_TASK_STACK_SIZE, NULL, MAIN_TASK_PRIORITY, &main_task_handler) != pdPASS)
    {
        CY_ASSERT(0);
    }

    /* Start the FreeRTOS scheduler. */
    vTaskStartScheduler();

    CY_ASSERT(0);
}

/*******************************************************************************
* Function Name: main_task
********************************************************************************
* Summary:
* This is the main task.
*    1. Creates a timer to toggle user LED
*    2. Create the processing RTOS task
*    3. Initializes the hardware interface to the sensor and LEDs
*    4. Initializes the radar device
*    5. In an infinite loop
*       - Waits for interrupt from radar device indicating availability of data
*       - Reads the data, converts it to floating point and notifies the processing task
* Parameters:
*  void
*
* Return:
*  none
*
*******************************************************************************/
static __NO_RETURN void main_task(void *pvParameters)
{
    (void)pvParameters;
    uint32_t sz;
    uint16_t *data_buff = NULL;
    cy_rslt_t result;
    XENSIV_RADAR_PRESENCE_TIMESTAMP last_timestamp = 0;

    logger_init();
#ifdef ENABLE_RADAR
    /* Radar demo has no logger CLI/button (the stock radar console owns
     * stdin), so presence events print immediately, human-readable. */
    logger_set_mode(LOG_MODE_HUMAN);
    logger_set_enabled(true);
#else
    /* Data-collection rig: CSV mode, gated off until `start` or BTN1. */
    logger_set_mode(LOG_MODE_CSV);
#endif
    timer_handler = xTimerCreate("timer", pdMS_TO_TICKS(1000), pdTRUE, NULL, timer_callbak);    
    if (timer_handler == NULL)
    {
        CY_ASSERT(0);
    }

    if (xTimerStart(timer_handler, 0) != pdPASS)
    {
        CY_ASSERT(0);
    }

