aadabathon/PSoC6AI-workingDir/source/main.c
#ifdef ENABLE_RADAR
    if (xTaskCreate(processing_task, PROCESSING_TASK_NAME, PROCESSING_TASK_STACK_SIZE, NULL, PROCESSING_TASK_PRIORITY, &processing_task_handler) != pdPASS)
    {
        CY_ASSERT(0);
    }

    if (init_sensor() != 0)
    {
        CY_ASSERT(0);
    }

    if (init_leds () != 0)
    {
        CY_ASSERT(0);
    }
#endif

    /* ---- 9-DOF I2C sensor stack (DPS368 + BMI270 + BMM350) + mic ---- */
    if (i2c_bus_init() == CY_RSLT_SUCCESS)
        {
            barometer_task_init();
            vTaskDelay(pdMS_TO_TICKS(150));
            imu_task_init();
            vTaskDelay(pdMS_TO_TICKS(750));   // ← more time before mag; BMM350 init is slow
            mag_task_init();
            vTaskDelay(pdMS_TO_TICKS(500));
            mic_task_init();
            printf("[sensors] sensor stack online\r\n");
        }
    else
        {
            printf("[sensors] i2c_bus_init FAILED\r\n");
        }

#ifndef ENABLE_RADAR
    /* Recording controls: USER BTN1 toggles capture (LED1 mirrors it) and
     * the logger CLI owns stdin. In the radar build the stock radar console
     * owns stdin and the LEDs instead, so neither is started there. */
    if (button_task_init() != CY_RSLT_SUCCESS)
    {
        printf("[button] init FAILED\r\n");
    }
    if (logger_cli_init() != CY_RSLT_SUCCESS)
    {
        printf("[cli] init FAILED\r\n");
    }

    /* Wi-Fi TCP CSV sink (source/tasks/wifi_task.c). Joining is skipped
     * (not a boot-time failure) if source/tasks/wifi_config.h still has
     * the placeholder SSID -- see wifi_task.c for that check. */
    if (wifi_task_init() != CY_RSLT_SUCCESS)
    {
        printf("[wifi] init FAILED\r\n");
    }
#endif

    /* ---- QSPI flash: ring-buffer logging sink (opt-in via CLI `sink
     * flash`/`sink both`). See logger_flash.h for the on-flash layout. ---- */
    if (logger_flash_init() != CY_RSLT_SUCCESS)
    {
        printf("[flash] init FAILED\r\n");
    }
    /* -------------------------------------------------------------- */

#ifdef ENABLE_RADAR
    mgr.subscribe(main_task_handler);

    /* Initialize the initial state of ce_app_state */
    ce_app_state.last_reported_event.state = XENSIV_RADAR_PRESENCE_STATE_ABSENCE;
    ce_app_state.last_reported_event.range_bin = 0;
    ce_app_state.last_reported_event.timestamp = 0;

    if (xensiv_bgt60trxx_start_frame(&bgt60_obj.dev, true) != XENSIV_BGT60TRXX_STATUS_OK)
    {
        CY_ASSERT(0);
    }

    for(;;)
    {
        /* Wait for the GPIO interrupt to indicate that another slice is available */
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        mgr.read_from_buffer(1, &data_buff, &sz);

        /* Data preprocessing */
        uint16_t *bgt60_buffer_ptr = data_buff;
        float32_t *frame_ptr = &frame[0];
        for (int32_t sample = 0; sample < NUM_SAMPLES_PER_FRAME * 2; ++sample)
        {
            *frame_ptr++ = ((float32_t)(*bgt60_buffer_ptr++) / 4096.0F);
        }

        mgr.ack_data_read(1);

        /* calculate the average of the chirps first */
        arm_fill_f32(0, avg_chirp, NUM_SAMPLES_PER_CHIRP);

        for (int chirp = 0; chirp < NUM_CHIRPS_PER_FRAME * 2; chirp++)
        {
            arm_add_f32(avg_chirp, &frame[NUM_SAMPLES_PER_CHIRP * chirp], avg_chirp, NUM_SAMPLES_PER_CHIRP);
        }

        arm_scale_f32(avg_chirp, 1.0f / NUM_CHIRPS_PER_FRAME, avg_chirp, NUM_SAMPLES_PER_CHIRP);

        if(ce_app_state.last_reported_event.timestamp != last_timestamp)
        {
            last_timestamp = ce_app_state.last_reported_event.timestamp; // save latest timestamp
            result = radar_config_optimize(ce_app_state.last_reported_event.state);
            if(result != ESTATUS_SUCCESS)
            {
                printf("[MSG] ERROR: radar_config_optimize failed with error %" PRIi32 "\n", result);
                CY_ASSERT(0);
            }
        }

        /* Tell processing task to take over */
        xTaskNotifyGive(processing_task_handler);

    }
#else
    (void)sz;
    (void)data_buff;
    (void)result;
    (void)last_timestamp;

    for (;;)
    {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
#endif
}

#ifdef ENABLE_RADAR
/*******************************************************************************
* Function Name: processing_task
********************************************************************************
* Summary:
* This is the data processing task.
*    1. Initializes the presence sensing library and register an event callback
*    2. It creates a console task to handle parameter configuration for the library
*    3. In a loop
*       - receives notification from main task
*       - executes the presence algorithm and provides the result on terminal and LEDs
*
* Parameters:
*  void
*
* Return:
*  None
*
*******************************************************************************/
static __NO_RETURN void processing_task(void *pvParameters)
{
    (void)pvParameters;

    xensiv_radar_presence_handle_t handle;
    cy_rslt_t result;

    xensiv_radar_presence_set_malloc_free(pvPortMalloc,
                                          vPortFree);

    if (xensiv_radar_presence_alloc(&handle, &default_config) != 0)
    {
        CY_ASSERT(0);
    }

    xensiv_radar_presence_set_callback(handle, presence_detection_cb, NULL);
    result = radar_config_optimizer_init(reconf_radar);

    if(result != ESTATUS_SUCCESS)
    {
        printf("[MSG] ERROR: radar_config_optimizer_init failed with error %" PRIi32 "\n", result);
        CY_ASSERT(0);
    }

    result = radar_config_optimizer_set_operational_mode(default_config.mode);

    if(result != ESTATUS_SUCCESS)
    {
        printf("[MSG] ERROR: radar_config_optimizer_set_operational_mode failed with error %" PRIi32 "\n", result);
        CY_ASSERT(0);
    }

    if (xTaskCreate(console_task, CLI_TASK_NAME, CLI_TASK_STACK_SIZE, handle, CLI_TASK_PRIORITY, NULL) != pdPASS)
    {
        CY_ASSERT(0);
    }

    for(;;)
    {
        /* Wait for frame data available to process */
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        xensiv_radar_presence_process_frame(handle, avg_chirp, xTaskGetTickCount() * portTICK_PERIOD_MS);
        process_verbose_cmd(handle, xTaskGetTickCount() * portTICK_PERIOD_MS);
    }
}


